; domain
(define (domain trucking-domain)
  (:requirements :strips :typing)

  (:types truck city package)

  (:predicates 
    (truck-at ?t - truck ?c - city)      ; A truck is at a city
    (package-at ?p - package ?c - city)  ; A package is at a city
    (empty ?t - truck)                   ; A truck is empty
    (loaded ?p - package ?t - truck)     ; A package is loaded into a truck
  )

  ;; Drive a truck from one city to another
  (:action drive
    :parameters (?t - truck ?from - city ?to - city)
    :precondition (truck-at ?t ?from)
    :effect (and (not (truck-at ?t ?from)) (truck-at ?t ?to))
  )

  ;; Load a package into an empty truck
  (:action load
    :parameters (?p - package ?t - truck ?c - city)
    :precondition (and (package-at ?p ?c) (truck-at ?t ?c) (empty ?t))
    :effect (and (not (package-at ?p ?c)) (not (empty ?t)) (loaded ?p ?t))
  )

  ;; Unload a package from a truck to a city
  (:action unload
    :parameters (?p - package ?t - truck ?c - city)
    :precondition (and (loaded ?p ?t) (truck-at ?t ?c))
    :effect (and (not (loaded ?p ?t)) (package-at ?p ?c) (empty ?t))
  )
)

; problem
(define (problem trucking-problem)
  (:domain trucking-domain)

  (:objects
    truck1 truck2 - truck
    cityA cityB - city
    package1 - package
  )

  (:init
    (truck-at truck1 cityA)
    (truck-at truck2 cityB)
    (package-at package1 cityA)
    (empty truck1)
    (empty truck2)
  )

  (:goal
    (package-at package1 cityB)
  )
)

; plan
1. (drive truck2 cityb citya)
   deleted: (truck-at truck2 cityb)
   added: (truck-at truck2 citya)
   goals met: 0 of 1
2. (load package1 truck2 citya)
   deleted: (package-at package1 citya) (empty truck2)
   added: (loaded package1 truck2)
   goals met: 0 of 1
3. (drive truck2 citya cityb)
   deleted: (truck-at truck2 citya)
   added: (truck-at truck2 cityb)
   goals met: 0 of 1
4. (unload package1 truck2 cityb)
   deleted: (loaded package1 truck2)
   added: (package-at package1 cityb) (empty truck2)
   goals met: 1 of 1
